
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>界面布局说明 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-fexa/fexa.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2.2.html" />
    
    

    </head>
    <body>
        
<div class="book">
	<div class="header-inner">
		<!-- LOGO -->
		<div class="logo"></div>
		<span class="title"></span>

		<!-- Search -->
		
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>


		<!-- Nav -->
		<ul class="header-nav">
			<li>
				<a href="https://yunzhangfang.com/" target="_blank">公司官网</a>
			</li><li>
				<a href="https://www.autoworkrpa.com/" target="_blank">产品官网</a>
			</li>
		</ul>
	</div>

	<div class="book-summary">
		<div class="book-summary-title">文档目录</div>
		
		
		<nav role="navigation">
			


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    产品介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    安装与注册
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    安装说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    注册账号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    激活并登录
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    界面框架介绍
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    界面布局说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    工具栏功能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    流程视图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    日志模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="2.5.html">
            
                <a href="2.5.html">
            
                    
                    输出窗口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="2.6.html">
            
                <a href="2.6.html">
            
                    
                    调试窗口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="2.7.html">
            
                <a href="2.7.html">
            
                    
                    变量窗口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="2.8.html">
            
                <a href="2.8.html">
            
                    
                    资源窗口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="2.9.html">
            
                <a href="2.9.html">
            
                    
                    组件库以及可视化组件调用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    快速开始
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    制作你的第一个机器人
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


		</nav>
		
		
	</div>

	<!-- Content nav -->
	<div class="book-anchor">
		<div class="book-anchor-title">在这篇文章中:</div>
		<div class="book-anchor-body">

		</div>
	</div>

	<div class="book-body">
		
		<div class="body-inner">
			
			

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >界面布局说明</a>
    </h1>
</div>




			<div class="page-wrapper" tabindex="-1" role="main">
				<div class="page-inner">
					
<div id="book-search-results">
    <div class="search-noresults">
    
					<section class="normal markdown-section">
						
						<h1 id="&#x754C;&#x9762;&#x5E03;&#x5C40;&#x8BF4;&#x660E;">&#x754C;&#x9762;&#x5E03;&#x5C40;&#x8BF4;&#x660E;</h1>
<hr>
<h2 id="&#x6D41;&#x7A0B;&#x7BA1;&#x7406;&#x754C;&#x9762;">&#x6D41;&#x7A0B;&#x7BA1;&#x7406;&#x754C;&#x9762;</h2>
<ul>
<li>&#x6D41;&#x7A0B;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x7528;&#x4E8E;&#x81EA;&#x52A8;&#x5316;&#x5904;&#x7406;&#x7684;&#x4EFB;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x7531;&#x4EBA;&#x6765;&#x8BBE;&#x8BA1;&#x7F16;&#x5199;&#xFF0C;&#x5E76;&#x4EA4;&#x7ED9;&#x673A;&#x5668;&#x4EBA;&#x8D1F;&#x8D23;&#x8FD0;&#x884C;&#x3002;</li>
</ul>
<p><img src="pic/2.1/manage1.png" alt=""></p>
<ul>
<li>&#x672C;&#x5730;&#x6D41;&#x7A0B;&#x3002;&#x5305;&#x62EC;&#x672C;&#x5730;&#x7F16;&#x8F91;&#x7684;&#x672A;&#x4E0A;&#x4F20;&#x7684;&#x6D41;&#x7A0B;&#x4EE5;&#x53CA;&#x4ECE;&#x7EBF;&#x4E0A;&#x4E0B;&#x8F7D;&#x7684;&#x6D41;&#x7A0B;&#x3002;<ul>
<li>&#x672C;&#x5730;&#x6D41;&#x7A0B;&#x7684;&#x6807;&#x7B7E;&#x9875;&#x663E;&#x793A;&#x6D41;&#x7A0B;&#x540D;&#x79F0;&#x3001;&#x6240;&#x5728;&#x7684;&#x6587;&#x4EF6;&#x76EE;&#x5F55;</li>
<li>&#x672A;&#x4E0A;&#x4F20;&#x8FC7;&#x7684;&#x672C;&#x5730;&#x6D41;&#x7A0B;&#x6CA1;&#x6709;&#x7248;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x4ECE;&#x7EBF;&#x4E0A;&#x4E0B;&#x8F7D;&#x5230;&#x672C;&#x5730;&#x7684;&#x6D41;&#x7A0B;&#x5219;&#x4F1A;&#x663E;&#x793A;&#x7248;&#x672C;&#x4FE1;&#x606F;</li>
<li>&#x53E6;&#x5916;&#xFF0C;&#x7EBF;&#x4E0A;&#x4E0B;&#x8F7D;&#x7684;&#x6D41;&#x7A0B;&#x4F1A;&#x591A;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x66F4;&#x65B0;&#x6309;&#x94AE;&#xFF0C;&#x70B9;&#x51FB;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x66F4;&#x65B0;&#x672C;&#x5730;&#x7684;&#x6D41;&#x7A0B;&#x6587;&#x4EF6;&#x5230;&#x6700;&#x65B0;&#x7248;&#x672C;</li>
<li>&#x70B9;&#x51FB;&#x53F3;&#x4FA7;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x56FE;&#x6807;&#x53EF;&#x4EE5;&#x6253;&#x5F00;&#x6D41;&#x7A0B;&#x6240;&#x5728;&#x7684;&#x6587;&#x4EF6;&#x76EE;&#x5F55;</li>
<li>&#x9ED8;&#x8BA4;&#x6309;&#x7167;&#x6700;&#x8FD1;&#x6253;&#x5F00;&#x65F6;&#x95F4;&#x4ECE;&#x4E0A;&#x5F80;&#x4E0B;&#x6392;&#x5E8F;&#xFF0C;&#x70B9;&#x51FB;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x6700;&#x8FD1;&#x6253;&#x5F00;&#x6309;&#x94AE;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x5012;&#x5E8F;&#x6392;&#x5217;</li>
</ul>
</li>
</ul>
<p><img src="pic/2.1/manage5.png" alt=""></p>
<ul>
<li>&#x7EBF;&#x4E0A;&#x6D41;&#x7A0B;&#x3002;&#x7EBF;&#x4E0A;&#x6D41;&#x7A0B;&#x8868;&#x793A;&#x4ECE;&#x672C;&#x5730;&#x4E0A;&#x4F20;&#x5230; AutoWork &#x5546;&#x57CE;&#xFF08;&#x7BA1;&#x7406;&#x7AEF;&#x53EF;&#x67E5;&#x770B;&#xFF09;&#x4E2D;&#x7684;&#x6D41;&#x7A0B;&#x3002;<ul>
<li>&#x5728;&#x7EBF;&#x4E0A;&#x6D41;&#x7A0B;&#x6807;&#x7B7E;&#x9875;&#x4E2D;&#x5C55;&#x793A;&#x6D41;&#x7A0B;&#x7684;&#x7248;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x53CA;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x4E0B;&#x8F7D;&#x5230;&#x672C;&#x5730;&#x7684;&#x4FE1;&#x606F;</li>
<li>&#x5BF9;&#x4E8E;&#x672A;&#x4E0B;&#x8F7D;&#x7684;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x70B9;&#x51FB;&#x53F3;&#x4FA7;&#x7684;&#x56FE;&#x6807;&#x5C06;&#x6D41;&#x7A0B;&#x4E0B;&#x8F7D;&#x5230;&#x672C;&#x5730;&#xFF0C;&#x5DF2;&#x4E0B;&#x8F7D;&#x7684;&#x6D41;&#x7A0B;&#x5219;&#x4F1A;&#x63D0;&#x793A;&#x662F;&#x5426;&#x8986;&#x76D6;</li>
<li>&#x9ED8;&#x8BA4;&#x6309;&#x7167;&#x66F4;&#x65B0;&#x65F6;&#x95F4;&#x4ECE;&#x4E0A;&#x5F80;&#x4E0B;&#x6392;&#x5E8F;&#xFF0C;&#x70B9;&#x51FB;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x66F4;&#x65B0;&#x65F6;&#x95F4;&#x6309;&#x94AE;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x5012;&#x5E8F;&#x6392;&#x5217;</li>
</ul>
</li>
</ul>
<ul>
<li><p>&#x90FD;&#x652F;&#x6301;&#x6839;&#x636E;&#x6D41;&#x7A0B;&#x540D;&#x79F0;&#x641C;&#x7D22;&#x6D41;&#x7A0B;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x5728;&#x6D41;&#x7A0B;&#x5F88;&#x591A;&#x7684;&#x65F6;&#x5019;&#x975E;&#x5E38;&#x6709;&#x7528;</p>
</li>
<li><p>&#x9F20;&#x6807;&#x79FB;&#x52A8;&#x5230;&#x6D41;&#x7A0B;&#x4E0A;&#x4E4B;&#x540E;&#x5728;&#x6700;&#x53F3;&#x4FA7;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;<code>X</code>&#x7B26;&#x53F7;&#xFF0C;&#x70B9;&#x51FB;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x6D41;&#x7A0B;</p>
</li>
</ul>
<p><img src="pic/2.1/manage6.png" alt=""></p>
<ul>
<li>&#x65B0;&#x5EFA;&#x6D41;&#x7A0B;&#x3002;&#x70B9;&#x51FB;&#x53F3;&#x4E0B;&#x89D2;&#x7684;&#x65B0;&#x5EFA;&#x6309;&#x94AE;&#xFF0C;&#x5728;&#x5F39;&#x51FA;&#x7684;&#x7A97;&#x53E3;&#x4E2D;&#x586B;&#x5199;&#x6D41;&#x7A0B;&#x540D;&#x79F0;&#x5E76;&#x9009;&#x62E9;&#x4FDD;&#x5B58;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x70B9;&#x51FB;&#x786E;&#x5B9A;&#x5373;&#x53EF;</li>
</ul>
<p><img src="pic/2.1/manage7.png" alt=""></p>
<ul>
<li>&#x6253;&#x5F00;&#x672C;&#x5730;&#x7684;&#x6D41;&#x7A0B;&#x6587;&#x4EF6;&#x3002;&#x70B9;&#x51FB;&#x53F3;&#x4E0B;&#x89D2;&#x7684;&#x6253;&#x5F00;&#x6309;&#x94AE;&#xFF0C;&#x5728;&#x5F39;&#x51FA;&#x7684;&#x7A97;&#x53E3;&#x4E2D;&#x9009;&#x62E9;&#x6D41;&#x7A0B;&#x6240;&#x5728;&#x8DEF;&#x5F84;&#x4E0B;&#x7684;&#x540E;&#x7F00;&#x4E3A;<code>.autowork</code>&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x70B9;&#x51FB;&#x6253;&#x5F00;&#x5373;&#x53EF;</li>
</ul>
<p><img src="pic/2.1/update.png" alt=""></p>
<ul>
<li><p>&#x68C0;&#x67E5;&#x66F4;&#x65B0;&#x3002;&#x5355;&#x51FB;&#x5DE6;&#x4E0B;&#x89D2;&#x7684;&#x68C0;&#x67E5;&#x66F4;&#x65B0;&#x6309;&#x94AE;&#x53EF;&#x4EE5;&#x5BF9;&#x8BBE;&#x8BA1;&#x7AEF;&#x8FDB;&#x884C;&#x5347;&#x7EA7;&#x3002;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x662F;&#x6700;&#x65B0;&#x7248;&#x5219;&#x4F1A;&#x5F39;&#x51FA;&#x7A97;&#x53E3;&#x63D0;&#x793A;&#x3002;</p>
</li>
<li><p>&#x9F20;&#x6807;&#x79FB;&#x52A8;&#x5230;&#x6D41;&#x7A0B;&#x4E0A;&#x76F4;&#x63A5;&#x70B9;&#x51FB;&#x4E4B;&#x540E;&#x4F1A;&#x8FDB;&#x5165;&#x6D41;&#x7A0B;&#x8BBE;&#x8BA1;&#x754C;&#x9762;</p>
</li>
</ul>
<h2 id="&#x6D41;&#x7A0B;&#x8BBE;&#x8BA1;&#x754C;&#x9762;">&#x6D41;&#x7A0B;&#x8BBE;&#x8BA1;&#x754C;&#x9762;</h2>
<p><img src="pic/2.1/manage2.png" alt=""></p>
<ul>
<li>&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#x7531;&#x8BBE;&#x8BA1;&#x754C;&#x9762;&#x7684;&#x903B;&#x8F91;&#x63A7;&#x5236;&#x6D41;&#x548C;&#x7EC4;&#x4EF6;&#x8C03;&#x7528;&#x6240;&#x7EC4;&#x6210;&#x3002;&#x903B;&#x8F91;&#x63A7;&#x5236;&#x6D41;&#x8D1F;&#x8D23;&#x6D41;&#x7A0B;&#x7684;&#x8FD0;&#x884C;&#x903B;&#x8F91;&#xFF0C;&#x4E0D;&#x8FC7;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x62BD;&#x8C61;&#x5316;&#x5C55;&#x793A;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6237;&#x5BF9;&#x6D41;&#x7A0B;&#x7684;&#x5404;&#x90E8;&#x5206;&#x529F;&#x80FD;&#x6709;&#x4E2A;&#x6E05;&#x6670;&#x7684;&#x4E86;&#x89E3;&#xFF1B;&#x7EC4;&#x4EF6;&#x8C03;&#x7528;&#x662F;&#x6267;&#x884C;&#x547D;&#x4EE4;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x5143;&#xFF0C;&#x4E5F;&#x662F; RPA &#x5982;&#x6B64;&#x5F3A;&#x5927;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x2014;&#x2014;&#x5B83;&#x5185;&#x7F6E;&#x4E86;&#x5927;&#x91CF;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x7684;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x3002;</li>
</ul>
<ul>
<li>&#x3010;&#x5DE5;&#x5177;&#x680F;&#x3011;&#x5305;&#x62EC;&#x8FD4;&#x56DE;&#x3001;&#x4FDD;&#x5B58;&#x3001;&#x4E0A;&#x4F20;&#x3001;&#x8FD0;&#x884C;&#x3001;&#x505C;&#x6B62;&#x3001;&#x64A4;&#x9500;&#x3001;&#x6062;&#x590D;&#x529F;&#x80FD;&#x3002;<ul>
<li>&#x8FD4;&#x56DE;&#xFF1A;&#x56DE;&#x5230;&#x6D41;&#x7A0B;&#x7BA1;&#x7406;&#x754C;&#x9762;</li>
<li>&#x4FDD;&#x5B58;&#xFF1A;&#x4FDD;&#x5B58;&#x5F53;&#x524D;&#x7684;&#x6D41;&#x7A0B;&#x72B6;&#x6001;</li>
<li>&#x4E0A;&#x4F20;&#xFF1A;&#x5C06;&#x5F53;&#x524D;&#x8BBE;&#x8BA1;&#x7684;&#x6D41;&#x7A0B;&#x4E0A;&#x4F20;&#x81F3; AutoWork &#x5546;&#x57CE;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x5728;&#x7BA1;&#x7406;&#x7AEF;&#x8BA4;&#x9886;&#x9700;&#x6C42;&#xFF0C;&#x4E0A;&#x4F20;&#x65F6;&#x9009;&#x62E9;&#x6D41;&#x7A0B;&#x8981;&#x5173;&#x8054;&#x7684;&#x9700;&#x6C42;</li>
<li>&#x8FD0;&#x884C;&#xFF1A;&#x76F4;&#x63A5;&#x5728;&#x8BE5;&#x9875;&#x9762;&#x70B9;&#x51FB;&#x4F1A;&#x5B8C;&#x6574;&#x8FD0;&#x884C;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#xFF0C;&#x5176;&#x4ED6;&#x9875;&#x9762;&#x70B9;&#x51FB;&#x7684;&#x6548;&#x679C;&#x89C1;&#x4E0B;&#x65B9;</li>
<li>&#x505C;&#x6B62;&#xFF1A;&#x4E2D;&#x65AD;&#x6D41;&#x7A0B;&#x8FD0;&#x884C;&#xFF0C;&#x82E5;&#x6D41;&#x7A0B;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x4E2D;&#x5219;&#x4F1A;&#x4E2D;&#x65AD;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;</li>
<li>&#x64A4;&#x9500;&#xFF1A;&#x64A4;&#x9500;&#x4E0A;&#x4E00;&#x6B65;&#x7684;&#x7F16;&#x8F91;&#x52A8;&#x4F5C;</li>
<li>&#x6062;&#x590D;&#xFF1A;&#x6062;&#x590D;&#x64A4;&#x9500;&#x7684;&#x5185;&#x5BB9;</li>
</ul>
</li>
</ul>
<ul>
<li>&#x3010;&#x6D41;&#x7A0B;&#x5757;&#x63A7;&#x4EF6;&#x3011;&#x4F9D;&#x6B21;&#x4E3A;&#x5F00;&#x59CB;&#x3001;&#x666E;&#x901A;&#x6D41;&#x7A0B;&#x3001;&#x7236;&#x5B50;&#x6D41;&#x7A0B;&#x3001;&#x5FAA;&#x73AF;&#x3001;&#x5224;&#x65AD;&#x3001;&#x7ED3;&#x675F;&#x3002;<ul>
<li>&#x5F00;&#x59CB;&#xFF1A;&#x6D41;&#x7A0B;&#x8FD0;&#x884C;&#x7684;&#x5165;&#x53E3;</li>
<li>&#x666E;&#x901A;&#x6D41;&#x7A0B;&#xFF1A;&#x6700;&#x5E38;&#x7528;&#x7684;&#x63A7;&#x4EF6;&#xFF0C;&#x5728;&#x5176;&#x4E2D;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x62D6;&#x62FD;&#x7EC4;&#x4EF6;&#x64CD;&#x4F5C;&#x5E76;&#x5B9E;&#x73B0;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x6D41;&#x7A0B;&#x903B;&#x8F91;</li>
<li>&#x7236;&#x5B50;&#x6D41;&#x7A0B;&#xFF1A;&#x5BB9;&#x5668;&#x7ED3;&#x6784;&#xFF0C;&#x5176;&#x5185;&#x90E8;&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x6D41;&#x7A0B;&#x753B;&#x5E03;&#xFF0C;&#x53EF;&#x4EE5;&#x5BB9;&#x7EB3;&#x5176;&#x4ED6;&#x666E;&#x901A;&#x6D41;&#x7A0B;&#x3001;&#x751A;&#x81F3;&#x7236;&#x5B50;&#x6D41;&#x7A0B;&#x3002;</li>
<li>&#x5FAA;&#x73AF;&#xFF1A;&#x5BB9;&#x5668;&#x7ED3;&#x6784;&#xFF0C;&#x7528;&#x4E8E;&#x5BF9;&#x63A7;&#x4EF6;&#x5185;&#x90E8;&#x7684;&#x6D41;&#x7A0B;&#x6267;&#x884C;&#x591A;&#x6B21;&#x91CD;&#x590D;&#x64CD;&#x4F5C;</li>
<li>&#x5224;&#x65AD;&#xFF1A;&#x63A7;&#x5236;&#x6D41;&#xFF0C;&#x5728;&#x5F53;&#x524D;&#x753B;&#x5E03;&#x5185;&#x901A;&#x8FC7;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x7684;&#x8D70;&#x5411;</li>
</ul>
</li>
</ul>
<ul>
<li><p>&#x3010;&#x6D41;&#x7A0B;&#x903B;&#x8F91;&#x7F16;&#x8F91;&#x533A;&#x3011;&#x91C7;&#x7528;&#x62D6;&#x62FD;&#x5F0F;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#xFF0C;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x6D41;&#x7A0B;&#x3002;</p>
</li>
<li><p>&#x3010;&#x6D41;&#x7A0B;&#x7ED3;&#x6784;&#x89C6;&#x56FE;&#x3011;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x5C55;&#x793A;&#x53EF;&#x4EE5;&#x7F16;&#x8F91;&#x7684;&#x6D41;&#x7A0B;&#x4FE1;&#x606F;&#xFF0C;&#x70B9;&#x51FB;&#x540E;&#x4F1A;&#x76F4;&#x63A5;&#x8DF3;&#x8F6C;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x9875;&#x9762;&#x3002;</p>
</li>
<li><p>&#x3010;&#x6D41;&#x7A0B;&#x5757;&#x5C5E;&#x6027;&#x7F16;&#x8F91;&#x53CA;&#x663E;&#x793A;&#x3011;&#x7528;&#x4E8E;&#x547D;&#x540D;&#x6D41;&#x7A0B;&#x5757;&#x3001;&#x8BBE;&#x7F6E;&#x63A7;&#x4EF6;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x7B49;&#x529F;&#x80FD;&#x3002;</p>
</li>
</ul>
<ul>
<li>&#x3010;&#x8F93;&#x51FA;&#x3001;&#x8C03;&#x8BD5;&#x3001;&#x53D8;&#x91CF;&#x3001;&#x8D44;&#x6E90;&#x9875;&#x9762;&#x3011;&#x7528;&#x4E8E;&#x5C55;&#x793A;&#x53CA;&#x7BA1;&#x7406;&#x5404;&#x9879;&#x5185;&#x5BB9;&#xFF0C;&#x53EF;&#x4EE5;&#x6536;&#x8D77;&#x6216;&#x5C55;&#x5F00;&#x3002;<ul>
<li>&#x8F93;&#x51FA;&#xFF1A;&#x8FD0;&#x884C;&#x6D41;&#x7A0B;&#x65F6;&#x6253;&#x5370;&#x7684;&#x4FE1;&#x606F;&#x90FD;&#x663E;&#x793A;&#x5728;&#x8FD9;&#x8FB9;</li>
<li>&#x8C03;&#x8BD5;&#xFF1A;&#x5728;&#x7EC4;&#x4EF6;&#x8C03;&#x7528;&#x754C;&#x9762;&#x65F6;&#xFF0C;&#x5DE5;&#x5177;&#x680F;&#x4E2D;&#x7684;&#x8FD0;&#x884C;&#x4F1A;&#x591A;&#x51FA;&#x4E00;&#x4E2A;&#x8C03;&#x8BD5;&#x9009;&#x9879;&#xFF0C;&#x4EE5;&#x8BE5;&#x6A21;&#x5F0F;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x8FB9;&#x5BF9;&#x8C03;&#x8BD5;&#x8FDB;&#x884C;&#x63A7;&#x5236;&#xFF0C;&#x5E76;&#x770B;&#x5230;&#x5168;&#x5C40;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x975E;&#x5E38;&#x65B9;&#x4FBF;</li>
<li>&#x53D8;&#x91CF;&#xFF1A;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x5168;&#x5C40;&#x4E0E;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x540E;&#x9762;&#x4F1A;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;</li>
<li>&#x8D44;&#x6E90;&#xFF1A;&#x6D41;&#x7A0B;&#x76F8;&#x5173;&#x7684;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x5305;&#x62EC;&#x4F46;&#x4E0D;&#x9650;&#x4E8E;&#x6293;&#x53D6;&#x7684;&#x56FE;&#x7247;&#x3001;&#x6D41;&#x7A0B;&#x9700;&#x8981;&#x8C03;&#x7528;&#x7684; Python &#x811A;&#x672C;&#x3001;&#x8BFB;&#x53D6;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7B49;&#x7B49;</li>
</ul>
</li>
</ul>
<ul>
<li>&#x70B9;&#x51FB;&#x666E;&#x901A;&#x6D41;&#x7A0B;&#x63A7;&#x4EF6;&#x4E0A;&#x9762;&#x7684;&#x5C0F;&#x94C5;&#x7B14;&#x540E;&#xFF0C;&#x8FDB;&#x5165;&#x7EC4;&#x4EF6;&#x8C03;&#x7528;&#x754C;&#x9762;&#x3002;</li>
</ul>
<h2 id="&#x7EC4;&#x4EF6;&#x8C03;&#x7528;&#x754C;&#x9762;">&#x7EC4;&#x4EF6;&#x8C03;&#x7528;&#x754C;&#x9762;</h2>
<p><img src="pic/2.1/manage3.png" alt=""></p>
<ul>
<li>&#x4E0E;&#x6BCF;&#x4E2A;&#x666E;&#x901A;&#x6D41;&#x7A0B;&#x5185;&#x90E8;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#xFF0C;&#x7528;&#x4E8E;&#x7F16;&#x8F91;&#x666E;&#x901A;&#x6D41;&#x7A0B;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x70B9;&#x51FB;&#x666E;&#x901A;&#x6D41;&#x7A0B;&#x63A7;&#x4EF6;&#x4E0A;&#x9762;&#x7684;&#x5C0F;&#x94C5;&#x7B14;&#x4E4B;&#x540E;&#x6253;&#x5F00;&#x3002;</li>
</ul>
<ul>
<li>&#x3010;&#x5DE5;&#x5177;&#x680F;&#x3011;&#x548C;&#x6D41;&#x7A0B;&#x8BBE;&#x8BA1;&#x754C;&#x9762;&#x7C7B;&#x4F3C;&#xFF0C;&#x591A;&#x4E86;&#x5F55;&#x5236;&#x548C;&#x6279;&#x91CF;&#x6293;&#x53D6;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x529F;&#x80FD;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x751F;&#x6210;&#x76F8;&#x5E94;&#x7684;&#x7EC4;&#x4EF6;&#x8C03;&#x7528;&#x8BBE;&#x8BA1;&#x7684;&#x3002;<ul>
<li>&#x5F55;&#x5236;&#xFF1A;&#x5F39;&#x51FA;&#x5F55;&#x5236;&#x7A97;&#x53E3;&#xFF0C;&#x6839;&#x636E;&#x64CD;&#x4F5C;&#x5185;&#x5BB9;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7EC4;&#x4EF6;</li>
<li>&#x6279;&#x91CF;&#x6293;&#x53D6;&#xFF1A;&#x5BF9;&#x7F51;&#x9875;&#x76F8;&#x4F3C;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x6279;&#x91CF;&#x6293;&#x53D6;&#xFF0C;&#x652F;&#x6301;&#x81EA;&#x52A8;&#x7FFB;&#x9875;&#x53CA;&#x5143;&#x7D20;&#x5BF9;&#x9F50;</li>
</ul>
</li>
</ul>
<ul>
<li><p>&#x3010;&#x7EC4;&#x4EF6;&#x5E93;&#x3011;&#x8F6F;&#x4EF6;&#x5185;&#x7F6E;&#x7684;&#x6240;&#x6709;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x62D6;&#x62FD;&#x81F3;&#x53EF;&#x89C6;&#x5316;&#x7EC4;&#x4EF6;&#x8C03;&#x7528;&#x9875;&#x9762;&#x3002;</p>
</li>
<li><p>&#x3010;&#x53EF;&#x89C6;&#x5316;&#x7EC4;&#x4EF6;&#x8C03;&#x7528;&#x3011;&#x91C7;&#x7528;&#x62D6;&#x62FD;&#x5F0F;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#xFF0C;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x666E;&#x901A;&#x6D41;&#x7A0B;&#x3002;</p>
</li>
<li><p>&#x3010;&#x6D41;&#x7A0B;&#x7ED3;&#x6784;&#x89C6;&#x56FE;&#x3011;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x5C55;&#x793A;&#x53EF;&#x4EE5;&#x7F16;&#x8F91;&#x7684;&#x6D41;&#x7A0B;&#x4FE1;&#x606F;&#xFF0C;&#x70B9;&#x51FB;&#x540E;&#x4F1A;&#x76F4;&#x63A5;&#x8DF3;&#x8F6C;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x9875;&#x9762;&#x3002;</p>
</li>
<li><p>&#x3010;&#x8F93;&#x51FA;&#x3001;&#x8C03;&#x8BD5;&#x3001;&#x53D8;&#x91CF;&#x3001;&#x8D44;&#x6E90;&#x9875;&#x9762;&#x3011;&#x7528;&#x4E8E;&#x5C55;&#x793A;&#x53CA;&#x7BA1;&#x7406;&#x5404;&#x9879;&#x5185;&#x5BB9;&#xFF0C;&#x53EF;&#x4EE5;&#x6536;&#x8D77;&#x6216;&#x5C55;&#x5F00;&#x3002;</p>
</li>
<li><p>&#x3010;&#x7EC4;&#x4EF6;&#x5C5E;&#x6027;&#x7F16;&#x8F91;&#x53CA;&#x67E5;&#x770B;&#x3011;&#x6BCF;&#x4E2A;&#x7EC4;&#x4EF6;&#x7684;&#x8F93;&#x5165;&#x53C2;&#x6570;&#x53CA;&#x8FD4;&#x56DE;&#x503C;&#x90FD;&#x5728;&#x8FD9;&#x8FB9;&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;&#x3002;</p>
</li>
</ul>

						
					</section>
					
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

				</div>
			</div>
			
		</div>

		
		
		
		<a href="2.2.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 工具栏功能">
			<i class="fa fa-angle-right"></i>
		</a>
		
		
		
	</div>
	<script>
		var gitbook = gitbook || [];
		gitbook.push(function() {
			gitbook.page.hasChanged({"page":{"title":"界面布局说明","level":"1.3.1","depth":2,"next":{"title":"工具栏功能","level":"1.3.2","depth":2,"path":"2.2.md","ref":"2.2.md","articles":[]},"previous":{"title":"界面框架介绍","level":"1.3","depth":1,"ref":"","articles":[{"title":"界面布局说明","level":"1.3.1","depth":2,"path":"2.1.md","ref":"2.1.md","articles":[]},{"title":"工具栏功能","level":"1.3.2","depth":2,"path":"2.2.md","ref":"2.2.md","articles":[]},{"title":"流程视图","level":"1.3.3","depth":2,"path":"2.3.md","ref":"2.3.md","articles":[]},{"title":"日志模块","level":"1.3.4","depth":2,"path":"2.4.md","ref":"2.4.md","articles":[]},{"title":"输出窗口","level":"1.3.5","depth":2,"path":"2.5.md","ref":"2.5.md","articles":[]},{"title":"调试窗口","level":"1.3.6","depth":2,"path":"2.6.md","ref":"2.6.md","articles":[]},{"title":"变量窗口","level":"1.3.7","depth":2,"path":"2.7.md","ref":"2.7.md","articles":[]},{"title":"资源窗口","level":"1.3.8","depth":2,"path":"2.8.md","ref":"2.8.md","articles":[]},{"title":"组件库以及可视化组件调用","level":"1.3.9","depth":2,"path":"2.9.md","ref":"2.9.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{"themeFexa":{"nav":[{"url":"https://yunzhangfang.com/","target":"_blank","name":"公司官网"},{"url":"https://www.autoworkrpa.com/","target":"_blank","name":"产品官网"}]}},"plugins":["-sharing","-fontsettings","-lunr","-search","search-pro","expandable-chapters","chapter-fold","back-to-top-button","hide-element","theme-fexa","livereload"],"pluginsConfig":{"chapter-fold":{},"livereload":{},"search-pro":{},"theme-fexa":{"search-placeholder":"输入关键字搜索","logo":"./logo.png","favicon":"./favicon.ico"},"hide-element":{"elements":[".gitbook-link"]},"highlight":{},"back-to-top-button":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"2.1.md","mtime":"2020-07-14T09:13:36.337Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-07-14T08:43:49.345Z"},"basePath":".","book":{"language":""}});
		});
	</script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-fexa/fexa.js"></script>
        
    

    </body>
</html>

