
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>变量窗口 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-fexa/fexa.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2.8.html" />
    
    
    <link rel="prev" href="2.6.html" />
    

    </head>
    <body>
        
<div class="book">
	<div class="header-inner">
		<!-- LOGO -->
		<div class="logo"></div>
		<span class="title"></span>

		<!-- Search -->
		
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>


		<!-- Nav -->
		<ul class="header-nav">
			<li>
				<a href="https://yunzhangfang.com/" target="_blank">公司官网</a>
			</li><li>
				<a href="https://www.autoworkrpa.com/" target="_blank">产品官网</a>
			</li>
		</ul>
	</div>

	<div class="book-summary">
		<div class="book-summary-title">文档目录</div>
		
		
		<nav role="navigation">
			


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    产品介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    安装与注册
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    安装说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    注册账号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    激活并登录
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    界面框架介绍
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="2.1.html">
            
                <a href="2.1.html">
            
                    
                    界面布局说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="2.2.html">
            
                <a href="2.2.html">
            
                    
                    工具栏功能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="2.3.html">
            
                <a href="2.3.html">
            
                    
                    流程视图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="2.4.html">
            
                <a href="2.4.html">
            
                    
                    日志模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="2.5.html">
            
                <a href="2.5.html">
            
                    
                    输出窗口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="2.6.html">
            
                <a href="2.6.html">
            
                    
                    调试窗口
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.7" data-path="2.7.html">
            
                <a href="2.7.html">
            
                    
                    变量窗口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="2.8.html">
            
                <a href="2.8.html">
            
                    
                    资源窗口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="2.9.html">
            
                <a href="2.9.html">
            
                    
                    组件库以及可视化组件调用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    快速开始
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="3.1.html">
            
                <a href="3.1.html">
            
                    
                    制作你的第一个机器人
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


		</nav>
		
		
	</div>

	<!-- Content nav -->
	<div class="book-anchor">
		<div class="book-anchor-title">在这篇文章中:</div>
		<div class="book-anchor-body">

		</div>
	</div>

	<div class="book-body">
		
		<div class="body-inner">
			
			

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >变量窗口</a>
    </h1>
</div>




			<div class="page-wrapper" tabindex="-1" role="main">
				<div class="page-inner">
					
<div id="book-search-results">
    <div class="search-noresults">
    
					<section class="normal markdown-section">
						
						<h1 id="&#x53D8;&#x91CF;&#x7A97;&#x53E3;">&#x53D8;&#x91CF;&#x7A97;&#x53E3;</h1>
<hr>
<p><img src="pic/2.7/variable.png" alt=""></p>
<ul>
<li><p>&#x8FD9;&#x90E8;&#x5206;&#x6211;&#x4EEC;&#x5C06;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x6D41;&#x7A0B;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x2014;&#x2014;&#x53D8;&#x91CF;&#x3002;</p>
</li>
<li><p>&#x53D8;&#x91CF;&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x3002;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x548C;&#x4F20;&#x9012;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x90FD;&#x8981;&#x4FDD;&#x5B58;&#x5728;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#x4E2D;&#xFF1B;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x4FDD;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5E76;&#x7528;&#x53D8;&#x91CF;&#x6307;&#x5411;&#x8FD9;&#x7247;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x548C; Python &#x4E2D;&#x53D8;&#x91CF;&#x7684;&#x542B;&#x4E49;&#x4E00;&#x81F4;&#xFF08;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x6BD5;&#x7ADF;&#x662F;&#x7F16;&#x8BD1;&#x751F;&#x6210; Python &#x4EE3;&#x7801;&#x5E76;&#x8FD0;&#x884C;&#x7684;&#xFF09;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x7EC4;&#x4EF6;&#x65F6;&#xFF0C;&#x53D8;&#x91CF;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x88AB;&#x4F20;&#x9012;&#x7ED9;&#x7EC4;&#x4EF6;&#xFF0C;&#x5E76;&#x53C2;&#x4E0E;&#x7EC4;&#x4EF6;&#x7684;&#x6267;&#x884C;&#xFF08;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x7528;&#x6570;&#x5B57;&#x6216;&#x8005;&#x5B57;&#x7B26;&#x4E32;&#x8FD9;&#x4E9B; Python &#x5185;&#x7F6E;&#x7684;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x7528;&#x4E86;&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#x4F1A;&#x65B9;&#x4FBF;&#x5F88;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x8D4B;&#x503C;&#x4E00;&#x6B21;&#x5E76;&#x5728;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x53D8;&#x91CF;&#x6307;&#x5411;&#x7684;&#x503C;&#x4E3A;&#x4E0D;&#x53EF;&#x53D8;&#x7C7B;&#x578B;&#xFF09;&#x3002;</p>
</li>
<li><p>&#x53D8;&#x91CF;&#x7684;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#x3002;&#x548C; Python &#x4E00;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4EFB;&#x4F55;&#x4F60;&#x559C;&#x6B22;&#x7684;&#x540D;&#x5B57;&#x6765;&#x547D;&#x540D;&#xFF0C;&#x4F46;<span style="border-bottom:2px dashed gray;">&#x4E0D;&#x8981;&#x4EE5;&#x6570;&#x5B57;&#x5F00;&#x5934;</span><sup>&#x6CE8;1</sup>&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5EFA;&#x8BAE;&#x7684;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#x662F;&#x7528;&#x5C0F;&#x5199;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#xFF0C;&#x4E2D;&#x95F4;&#x7528;&#x4E0B;&#x5212;&#x7EBF;<code>_</code>&#x9694;&#x5F00;&#xFF0C;&#x4E14;&#x82F1;&#x6587;&#x80FD;&#x591F;&#x660E;&#x786E;&#x8868;&#x8FBE;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x542B;&#x4E49;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#x662F;&#x7528;&#x6765;&#x4EE3;&#x8868;&#x4ECA;&#x5929;&#x7684;&#x65E5;&#x671F;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x79CD;&#x5408;&#x9002;&#x7684;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#x4E3A;<code>date_of_today</code>&#x3002;</p>
</li>
<li><p>&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;&#x8FD9;&#x79CD;&#x533A;&#x5206;&#x4E3B;&#x8981;&#x662F;&#x9488;&#x5BF9;&#x6D41;&#x7A0B;&#x5757;&#x6765;&#x8BF4;&#x7684;&#x3002;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x53EA;&#x5728;&#x67D0;&#x4E2A;&#x6D41;&#x7A0B;&#x5757;&#x5185;&#x90E8;&#x6709;&#x6548;&#xFF0C;&#x800C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5728;&#x6240;&#x6709;&#x6D41;&#x7A0B;&#x5757;&#x4E4B;&#x95F4;&#x90FD;&#x6709;&#x6548;&#x3002;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#x591A;&#x4E2A;&#x6D41;&#x7A0B;&#x5757;&#x4E2D;&#x90FD;&#x80FD;&#x51FA;&#x73B0;&#x76F8;&#x540C;&#x7684;&#x53D8;&#x91CF;&#x540D;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5404;&#x81EA;&#x7684;&#x8FD0;&#x884C;&#xFF1B;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#x53D8;&#x91CF;&#x5728;&#x591A;&#x4E2A;&#x6D41;&#x7A0B;&#x5757;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x5404;&#x81EA;&#x7684;&#x52A3;&#x52BF;&#x5206;&#x522B;&#x662F;&#x5404;&#x81EA;&#x4E0D;&#x5177;&#x5907;&#x7684;&#x5BF9;&#x65B9;&#x7684;&#x4F18;&#x52BF;&#xFF0C;<span style="border-bottom:2px dashed gray;">&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5728;&#x591A;&#x4E2A;&#x6D41;&#x7A0B;&#x5757;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x4F1A;&#x5F88;&#x9EBB;&#x70E6;</span><sup>&#x6CE8;2</sup>&#xFF1B;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x67D0;&#x4E2A;&#x6D41;&#x7A0B;&#x5757;&#x6539;&#x53D8;&#xFF0C;&#x800C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#x5757;&#x4E2D;&#x5F15;&#x7528;&#x65F6;&#x83B7;&#x53D6;&#x5230;&#x4E86;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8981;&#x5B66;&#x4F1A;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x3002;</p>
</li>
<li><p>&#x9ED8;&#x8BA4;&#x53D8;&#x91CF;&#x3002;&#x8FD9;&#x8FB9;&#x7684;&#x9ED8;&#x8BA4;&#x53D8;&#x91CF;&#x6307;&#x7684;&#x662F;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x5C31;&#x80FD;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x3002;AutoWork &#x5185;&#x7F6E;&#x4E86;&#x5F88;&#x591A;&#x9ED8;&#x8BA4;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#x9ED8;&#x8BA4;&#x4E0D;&#x663E;&#x793A;&#x3002;&#x5F53;&#x4F60;&#x62D6;&#x8FDB;&#x6765;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x4EE5;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x7EC4;&#x4EF6;&#x53F3;&#x4FA7;&#x7684;&#x5C5E;&#x6027;&#x680F;&#x4E2D;&#x6709;<code>&#x8F93;&#x51FA;&#x5230;</code>&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x91CC;&#x9762;&#x7684;&#x53D8;&#x91CF;&#x5C31;&#x4F1A;&#x81EA;&#x52A8;&#x6DFB;&#x52A0;&#x5230;&#x9ED8;&#x8BA4;&#x53D8;&#x91CF;&#x4E2D;&#x3002;</p>
</li>
</ul>
<ul>
<li>&#x521B;&#x5EFA;&#x53D8;&#x91CF;&#x3002;&#x8981;&#x521B;&#x5EFA;&#x81EA;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x6700;&#x63A8;&#x8350;&#x7684;&#x662F;&#x901A;&#x8FC7;&#x53D8;&#x91CF;&#x7A97;&#x53E3;&#x9762;&#x677F;&#x8FDB;&#x884C;&#x521B;&#x5EFA;&#x3002;<ul>
<li>&#x9996;&#x5148;&#x5728;&#x4E0A;&#x65B9;&#x9009;&#x62E9;&#x4F5C;&#x7528;&#x57DF;&#x7C7B;&#x578B;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x6765;&#x6307;&#x5B9A;&#x8981;&#x521B;&#x5EFA;&#x7684;&#x53D8;&#x91CF;&#x662F;&#x5168;&#x5C40;&#x8FD8;&#x662F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;</li>
<li>&#x70B9;&#x51FB;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x65B0;&#x589E;&#x6309;&#x94AE;&#xFF0C;&#x5728;&#x53D8;&#x91CF;&#x7A97;&#x53E3;&#x4E2D;&#x4F1A;&#x65B0;&#x51FA;&#x73B0;&#x4E00;&#x884C;&#xFF0C;&#x5728;&#x5176;&#x4E2D;&#x586B;&#x5199;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#x3001;&#x9ED8;&#x8BA4;&#x503C;&#x548C;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#xFF0C;&#x5176;&#x4E2D;&#x7B2C;&#x4E00;&#x9879;&#x4E3A;&#x5FC5;&#x586B;&#xFF0C;&#x5176;&#x4ED6;&#x4E24;&#x9879;&#x9009;&#x586B;&#x3002;</li>
<li>&#x5982;&#x679C;&#x6709;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x70B9;&#x51FB;&#x6700;&#x53F3;&#x8FB9;&#x7684;&#x7EA2;&#x8272;&#x53C9;&#x53D6;&#x6D88;&#x3002;</li>
<li>&#x70B9;&#x51FB;&#x6700;&#x53F3;&#x8FB9;&#x7684;&#x7EFF;&#x8272;&#x52FE;&#x4FDD;&#x5B58;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x3002;</li>
<li>&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x53D8;&#x91CF;&#x603B;&#x662F;&#x663E;&#x793A;&#x5728;&#x6700;&#x4E0A;&#x65B9;&#x3002;</li>
<li>&#x53E6;&#x5916;&#xFF0C;&#x7EC4;&#x4EF6;&#x5E93;-&#x8BED;&#x53E5;&#x547D;&#x4EE4;-&#x6D41;&#x7A0B;&#x63A7;&#x5236;-&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x7B49;&#x65B9;&#x6CD5;&#x4E5F;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x4E2A;&#x5728;&#x7EC4;&#x4EF6;&#x4F7F;&#x7528;&#x8BF4;&#x660E;&#x4E2D;&#x4F1A;&#x63D0;&#x5230;&#x3002;</li>
</ul>
</li>
</ul>
<ul>
<li><p>&#x4FEE;&#x6539;&#x53D8;&#x91CF;&#x3002;&#x5728;&#x53D8;&#x91CF;&#x7A97;&#x53E3;&#x5355;&#x51FB;&#x60F3;&#x8981;&#x4FEE;&#x6539;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x70B9;&#x51FB;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x7F16;&#x8F91;&#xFF0C;&#x6B64;&#x65F6;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x3001;&#x9ED8;&#x8BA4;&#x503C;&#x548C;&#x63CF;&#x8FF0;&#x90FD;&#x53D8;&#x4E3A;&#x53EF;&#x7F16;&#x8F91;&#x72B6;&#x6001;&#xFF0C;&#x4FEE;&#x6539;&#x5B8C;&#x6210;&#x540E;&#x70B9;&#x51FB;&#x6700;&#x53F3;&#x8FB9;&#x7684;&#x7EFF;&#x8272;&#x52FE;&#x4FDD;&#x5B58;&#x3002;</p>
</li>
<li><p>&#x5220;&#x9664;&#x53D8;&#x91CF;&#x3002;&#x5728;&#x53D8;&#x91CF;&#x7A97;&#x53E3;&#x5355;&#x51FB;&#x60F3;&#x8981;&#x5220;&#x9664;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x70B9;&#x51FB;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x5220;&#x9664;&#x5373;&#x53EF;&#x3002;</p>
</li>
<li><p>&#x53D8;&#x91CF;&#x641C;&#x7D22;&#x3002;&#x652F;&#x6301;&#x6839;&#x636E;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#x6216;&#x8005;&#x63CF;&#x8FF0;&#x6765;&#x6A21;&#x7CCA;&#x641C;&#x7D22;&#x53D8;&#x91CF;&#xFF0C;&#x76F4;&#x63A5;&#x5728;&#x53D8;&#x91CF;&#x7A97;&#x53E3;&#x5DE6;&#x4E0A;&#x89D2;&#x8F93;&#x5165;&#x5373;&#x53EF;&#x3002;</p>
</li>
<li><p>&#x53D8;&#x91CF;&#x79FB;&#x4F4D;&#x3002;&#x5728;&#x53D8;&#x91CF;&#x7A97;&#x53E3;&#x5355;&#x51FB;&#x60F3;&#x8981;&#x9009;&#x62E9;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x51FB;&#x53F3;&#x4E0A;&#x89D2;&#x7684;&#x4E0A;&#x79FB;&#x6309;&#x94AE;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x53D8;&#x91CF;&#x7684;&#x4F4D;&#x7F6E;&#x5F80;&#x4E0A;&#x79FB;&#x52A8;&#x3002;&#x7531;&#x4E8E;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x53D8;&#x91CF;&#x603B;&#x662F;&#x663E;&#x793A;&#x5728;&#x6700;&#x4E0A;&#x65B9;&#xFF0C;&#x6B64;&#x529F;&#x80FD;&#x7528;&#x4E8E;&#x5C06;&#x91CD;&#x8981;&#x7684;&#x53D8;&#x91CF;&#x79FB;&#x52A8;&#x5230;&#x4E0A;&#x65B9;&#xFF0C;&#x4FBF;&#x4E8E;&#x67E5;&#x770B;&#x3002;</p>
</li>
</ul>
<hr>
<p>&#x6CE8;1&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x7528;&#x6570;&#x5B57;&#x5F00;&#x5934;&#xFF0C;&#x8BBE;&#x8BA1;&#x7AEF;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x6307;&#x51FA;&#x4F60;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x4F1A;&#x62A5;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x6CE8;2&#xFF1A;&#x663E;&#x7136;&#x4E00;&#x79CD;&#x66F4;&#x5408;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x628A;&#x90A3;&#x4E2A;&#x53D8;&#x91CF;&#x8BBE;&#x7F6E;&#x4E3A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x5047;&#x8BBE;&#x4F60;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#x4E00;&#x5B9A;&#x8981;&#x5728;&#x4E24;&#x4E2A;&#x6D41;&#x7A0B;&#x5757;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x4E0D;&#x59A8;&#x8BBE;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x5757;&#x4F20;&#x9012;&#x7ED9;&#x7B2C;&#x4E8C;&#x4E2A;&#x7EC4;&#x4EF6;&#x5757;&#x3002;&#x9700;&#x8981;&#x5148;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#x5757;&#x4E2D;&#x8FD4;&#x56DE;&#x8BE5;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF08;&#x7EC4;&#x4EF6;&#x5E93;-&#x8BED;&#x53E5;&#x547D;&#x4EE4;-&#x6D41;&#x7A0B;&#x63A7;&#x5236;-&#x8DF3;&#x51FA;&#x8FD4;&#x56DE;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8BE5;&#x6D41;&#x7A0B;&#x5757;&#x7684;&#x5C5E;&#x6027;&#x4E2D;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7528;&#x6765;&#x63A5;&#x6536;&#x6D41;&#x7A0B;&#x5757;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#xFF08;&#x5728;&#x6D41;&#x7A0B;&#x8BBE;&#x8BA1;&#x754C;&#x9762;&#x5355;&#x51FB;&#x7EC4;&#x4EF6;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x53F3;&#x4FA7;&#x5C5E;&#x6027;&#x680F;&#x4E2D;&#x7684;&#x8F93;&#x51FA;&#x91CC;&#x9762;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x63A5;&#x7740;&#xFF0C;&#x628A;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x8BBE;&#x7F6E;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x7EC4;&#x4EF6;&#x5757;&#x7684;&#x8F93;&#x5165;&#xFF08;&#x5728;&#x6D41;&#x7A0B;&#x8BBE;&#x8BA1;&#x754C;&#x9762;&#x5355;&#x51FB;&#x90A3;&#x4E2A;&#x7EC4;&#x4EF6;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x53F3;&#x4FA7;&#x5C5E;&#x6027;&#x680F;&#x4E2D;&#x7684;&#x8F93;&#x5165;&#x91CC;&#x9762;&#x8BBE;&#x7F6E;&#x521A;&#x624D;&#x7684;&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x6700;&#x540E;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x7EC4;&#x4EF6;&#x5757;&#x4E2D;&#x83B7;&#x53D6;&#x8F93;&#x5165;&#x4E86;&#xFF08;&#x7EC4;&#x4EF6;&#x5E93;-&#x8BED;&#x53E5;&#x547D;&#x4EE4;-&#x6D41;&#x7A0B;&#x63A7;&#x5236;-&#x83B7;&#x53D6;&#x8F93;&#x5165;&#x53C2;&#x6570;&#xFF09;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x8FD9;&#x8FB9;&#x83B7;&#x53D6;&#x5230;&#x7684;&#x53C2;&#x6570;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x5143;&#x7EC4;&#xFF0C;&#x8981;&#x53D6;&#x5143;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x503C;&#x624D;&#x662F;&#x4F60;&#x8981;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>

						
					</section>
					
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

				</div>
			</div>
			
		</div>

		
		
		<a href="2.6.html" class="navigation navigation-prev " aria-label="Previous page: 调试窗口">
			<i class="fa fa-angle-left"></i>
		</a>
		
		
		<a href="2.8.html" class="navigation navigation-next " aria-label="Next page: 资源窗口">
			<i class="fa fa-angle-right"></i>
		</a>
		
		
		
	</div>
	<script>
		var gitbook = gitbook || [];
		gitbook.push(function() {
			gitbook.page.hasChanged({"page":{"title":"变量窗口","level":"1.3.7","depth":2,"next":{"title":"资源窗口","level":"1.3.8","depth":2,"path":"2.8.md","ref":"2.8.md","articles":[]},"previous":{"title":"调试窗口","level":"1.3.6","depth":2,"path":"2.6.md","ref":"2.6.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{"themeFexa":{"nav":[{"url":"https://yunzhangfang.com/","target":"_blank","name":"公司官网"},{"url":"https://www.autoworkrpa.com/","target":"_blank","name":"产品官网"}]}},"plugins":["-sharing","-fontsettings","-lunr","-search","search-pro","expandable-chapters","chapter-fold","back-to-top-button","hide-element","theme-fexa","pageview-count","livereload"],"pluginsConfig":{"chapter-fold":{},"livereload":{},"search-pro":{},"theme-fexa":{"search-placeholder":"输入关键字搜索","logo":"./logo.png","favicon":"./favicon.ico"},"hide-element":{"elements":[".gitbook-link"]},"highlight":{},"back-to-top-button":{},"pageview-count":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"2.7.md","mtime":"2020-07-14T05:45:43.196Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-07-14T09:30:18.951Z"},"basePath":".","book":{"language":""}});
		});
	</script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-fexa/fexa.js"></script>
        
    

    </body>
</html>

